In [4]:
import pandas as pd

In [28]:
df =  pd.read_csv('cart.csv' , parse_dates=['date'])

In [36]:
df["amount"].astype('Int32')

0       7
1      12
2    <NA>
3       2
4       6
5       3
6       5
Name: amount, dtype: Int32

In [37]:
df.isnull()

    date   name  amount  price
0  False  False   False  False
1  False  False   False  False
2  False  False    True  False
3  False  False   False   True
4   True  False   False  False
5  False  False   False  False
6  False   True   False  False

In [38]:
df.isnull().any(axis=1)

0    False
1    False
2     True
3     True
4     True
5    False
6     True
dtype: bool

In [39]:
df = pd.read_csv('metrics.csv' , parse_dates=['time'])
df.sample(10)

                      time name         value
15 2021-07-13 14:36:59.079  mem  2.275251e+08
32 2021-07-13 14:37:07.692  mem  2.275167e+08
7  2021-07-13 14:36:55.251  cpu  3.188000e+01
65 2021-07-13 14:37:23.004  cpu  3.298000e+01
82 2021-07-13 14:37:31.617  cpu  3.719000e+01
39 2021-07-13 14:37:10.563  mem  2.275438e+08
12 2021-07-13 14:36:58.122  mem  2.275156e+08
63 2021-07-13 14:37:22.047  mem  2.275327e+08
13 2021-07-13 14:36:58.122  cpu  3.233000e+01
51 2021-07-13 14:37:16.305  mem  2.275561e+08

In [13]:
df.groupby('name').describe()

     value                                                                  \
     count          mean           std     min           25%           50%
name
CPU    1.0  3.040000e+01           NaN   30.40  3.040000e+01  3.040000e+01
cpu   49.0  3.645633e+01  3.977927e+01  -32.14  2.956000e+01  3.157000e+01
mem   50.0  2.229711e+08  3.217637e+07  295.00  2.275070e+08  2.275188e+08


               75%          max
name
CPU   3.040000e+01         30.4
cpu   3.507000e+01        300.9
mem   2.275342e+08  227556054.0

In [15]:
df['name'].value_counts()

mem    50
cpu    49
CPU     1
Name: name, dtype: int64

In [24]:
df =  pd.read_csv('cart-dup.csv' , parse_dates=['date'])
df

        date    name  amount  price
0 2021-03-01  carrot       7   5.73
1 2021-03-01     egg      12   1.70
2 2021-03-01     egg      12   1.20
3 2021-03-01    milk       1   3.57
4 2021-03-02  potato       3   2.17
5 2021-03-02  potato       3   2.17

In [25]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [26]:
df.duplicated(['date', 'name'])

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

# a. Derive an index field and add it to the data set.

In [43]:
data = pd.read_csv('employees.csv')
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [45]:
#setting first name as index column
data.set_index("First Name" , inplace= True)

#display
data.head()

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [46]:
#setting first name as index column
data.set_index(["Salary" , "Gender"] , inplace= True , append=True, drop=False)

#display
data.head()

,,,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,Salary,Gender,,,,,,,
Douglas,97308,Male,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
Thomas,61933,Male,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
Maria,130590,Female,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
Jerry,138705,Male,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
Larry,101004,Male,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

# b. Find out the missing values.

In [51]:
import numpy as np

dict = {'First Score': [100,90,np.nan,95],
        'Second Score': [30,45,56,np.nan],
        'Third Score': [np.nan,40,80,98]
}

df = pd.DataFrame(dict)
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [52]:
import numpy as np

dict = {'First Score': [100,90,np.nan,95],
        'Second Score': [30,45,56,np.nan],
        'Third Score': [np.nan,40,80,98]
}

df = pd.DataFrame(dict)
df.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

# Handling missing values

In [53]:
import numpy as np

dict = {'First Score': [100,90,np.nan,95],
        'Second Score': [30,45,56,np.nan],
        'Third Score': [np.nan,40,80,98]
}

df = pd.DataFrame(dict)
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [55]:
import numpy as np

dict = {'First Score': [100,90,np.nan,95],
        'Second Score': [30,45,56,np.nan],
        'Third Score': [np.nan,40,80,98]
}

df = pd.DataFrame(dict)
#filling value from previous row
df.fillna(method= 'pad')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [56]:
import numpy as np

dict = {'First Score': [100,90,np.nan,95],
        'Second Score': [30,45,56,np.nan],
        'Third Score': [np.nan,40,80,98]
}

df = pd.DataFrame(dict)
#next row
df.bfill()

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [58]:
import numpy as np

data = pd.read_csv('employees.csv')

#will replace nan value with -99
data.replace(to_replace =  np.nan , value = -99)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,-99
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,-99,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [60]:
import numpy as np

dict = {'First Score': [100,90,np.nan,95],
        'Second Score': [30 , np.nan,45,56],
        'Third Score': [52,40,80,98],
        'Fourth Score': [np.nan,np.nan,np.nan,65]
}

df = pd.DataFrame(dict)

df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [61]:
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

# Exp 1

In [4]:

# import pandas as pd
import pandas as pd
df = pd.read_csv("uber.csv")

df.columns = [ 'key', 'fare_amount', 'pickup_datetime', 'pickup_longitude', 'pickup_latitude', 'dropoff_longitude', 'dropoff_latitude', 'passenger_count']
# df = df.drop(columns=(["pickup_longitude","pickup_latitude" , "dropoff_longitude", "dropoff_latitude"]))
df.head()

,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
13448846,2011-07-28 18:12:34.0000001,5.7,2011-07-28 18:12:34 UTC,-73.991995,40.770579,-73.981099,40.784488,1
39404033,2009-01-03 20:29:50.0000002,16.2,2009-01-03 20:29:50 UTC,-73.978585,40.736844,-73.936266,40.812318,1
16758709,2009-11-04 15:21:20.0000001,3.7,2009-11-04 15:21:20 UTC,-73.993757,40.732639,-73.994850,40.728090,1
26477142,2014-09-28 19:13:41.0000002,4.0,2014-09-28 19:13:41 UTC,-73.978058,40.753029,-73.980027,40.746389,1
53128057,2009-04-11 22:03:00.00000078,6.5,2009-04-11 22:03:00 UTC,-73.788412,40.647292,-73.980223,40.780482,2

In [8]:
def find_outliers_IQR(df):
    q1=df.quantile(0.25)
    q3=df.quantile(0.75)
    IQR = q3 - q1
    outliers = df[(df < (q1 - 1.5 * IQR) | (df > (q3 + 1.5 * IQR)))]
    return outliers

In [ ]:
outliers = find_outliers_IQR(df['fare_amount'])
print('number of outliers: ' + str(len(outliers)))
print('max outliers value: ' + str(outliers.max()))docs.google.com/document/u/0/
print('min outliers value: ' + str(outliers.min()))
outliers